# -*- coding:utf-8 -*-

# @Time : 2021/5/16 20:26
# @Author : HengHuang
# @File : test1.py 
# @Software: PyCharm

if __name__ == '__main__':
    # countrys58=['巴勒斯坦', '阿联酋', '尼泊尔', '卡塔尔', '东帝汶', '波黑', '斯洛文尼亚', '阿塞拜疆', '亚美尼亚', '土耳其', '黎巴嫩', '乌克兰', '哈萨克斯坦', '阿曼', '也门', '伊朗', '叙利亚', '沙特阿拉伯', '立陶宛', '老挝', '拉脱维亚', '捷克', '菲律宾', '埃及', '斯洛伐克', '白俄罗斯', '以色列', '新加坡', '越南', '匈牙利', '波兰', '俄罗斯', '塞尔维亚', '巴林', '黑山', '伊拉克', '摩尔多瓦', '爱沙尼亚', '克罗地亚', '格鲁吉亚', '约旦', '阿尔巴尼亚', '印度', '科威特', '罗马尼亚', '中国', '缅甸', '柬埔寨', '乌兹别克斯坦', '土库曼斯坦', '孟加拉国', '斯里兰卡', '蒙古国', '不丹', '塔吉克斯坦', '巴基斯坦', '马来西亚', '泰国']
    # country65=['不丹','东帝汶','中国','乌克兰','乌兹别克斯坦','也门','亚美尼亚','以色列','伊拉克','伊朗','俄罗斯','保加利亚','克罗地亚','匈牙利','北马其顿','卡塔尔','印度','印度尼西亚','叙利亚','吉尔吉斯斯坦','哈萨克斯坦','土库曼斯坦','土耳其','埃及','塔吉克斯坦','塞尔维亚','孟加拉国','尼泊尔','巴勒斯坦','巴基斯坦','巴林','拉脱维亚','捷克','摩尔多瓦','文莱','斯洛伐克','斯洛文尼亚','斯里兰卡','新加坡','柬埔寨','格鲁吉亚','沙特阿拉伯','波兰','波黑','泰国','爱沙尼亚','白俄罗斯','科威特','立陶宛','约旦','缅甸','罗马尼亚','老挝','菲律宾','蒙古国','越南','阿塞拜疆','阿富汗','阿尔巴尼亚','阿曼','阿联酋','马尔代夫','马来西亚','黎巴嫩','黑山']
    # for i in country65:
    #     if i not in countrys58:
    #         print(i)
    # string=input()
    # res=[]
    # while(string!=""):
    #     res.append(string)
    #     string=input()
    # print(res)
    pass