/*
 Navicat Premium Data Transfer

 Source Server         : 118.31.67.149 mysql
 Source Server Type    : MySQL
 Source Server Version : 50732 (5.7.32)
 Source Host           : 118.31.67.149:3306
 Source Schema         : beltandroad

 Target Server Type    : MySQL
 Target Server Version : 50732 (5.7.32)
 File Encoding         : 65001

 Date: 06/01/2023 02:02:02
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for FDI
-- ----------------------------
DROP TABLE IF EXISTS `FDI`;
CREATE TABLE `FDI`  (
  `id` int(11) NOT NULL,
  `country_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `2014_fdi` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2015_fdi` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2016_fdi` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2017_fdi` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2018_fdi` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2019_fdi` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `country_name_ref`(`country_name`) USING BTREE,
  CONSTRAINT `country_name_ref` FOREIGN KEY (`country_name`) REFERENCES `bilateralinvestment` (`countryname`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of FDI
-- ----------------------------
INSERT INTO `FDI` VALUES (1, '巴勒斯坦', '1.597亿美元', '1.049亿美元', '2.965亿美元', '2.034亿美元', '2.626亿美元', NULL);
INSERT INTO `FDI` VALUES (2, '阿联酋', '108.086亿美元', '88.211亿美元', '96.107亿美元', '103.458亿美元', '103.458亿美元', '131.890亿美元');
INSERT INTO `FDI` VALUES (3, '尼泊尔', '0.305亿美元', '0.518亿美元', '1.061亿美元', '1.963亿美元', NULL, NULL);
INSERT INTO `FDI` VALUES (4, '卡塔尔', '10.404亿美元', '10.709亿美元', '7.740亿美元', '9.860亿美元', '-21.862亿美元', '-18.580亿美元');
INSERT INTO `FDI` VALUES (5, '东帝汶', '0.339亿美元', '0.430亿美元', '0.054亿美元', '0.067亿美元', NULL, NULL);
INSERT INTO `FDI` VALUES (6, '波黑', '5.449亿美元', '3.831亿美元', '3.132亿美元', '4.642亿美元', '4.889亿美元', '5.550亿美元');
INSERT INTO `FDI` VALUES (7, '斯洛文尼亚', '10.193亿美元', '17.301亿美元', '14.463亿美元', '11.962亿美元', '15.238亿美元', '12.800亿美元');
INSERT INTO `FDI` VALUES (8, '阿塞拜疆', '44.305亿美元', '40.476亿美元', '44.997亿美元', '28.675亿美元', '14.030亿美元', '40.000亿美元');
INSERT INTO `FDI` VALUES (9, '亚美尼亚', '4.065亿美元', '1.842亿美元', '3.337亿美元', '2.509亿美元', '2.541亿美元', '3.000亿美元');
INSERT INTO `FDI` VALUES (10, '土耳其', '133.370亿美元', '192.630亿美元', '139.290亿美元', '110.990亿美元', '130.230亿美元', '84.190亿美元');
INSERT INTO `FDI` VALUES (11, '黎巴嫩', '28.625亿美元', '21.593亿美元', '25.685亿美元', '25.224亿美元', '26.321亿美元', '21.580亿美元');
INSERT INTO `FDI` VALUES (12, '乌克兰', '8.470亿美元', '30.500亿美元', '34.410亿美元', '28.270亿美元', '24.760亿美元', '30.430亿美元');
INSERT INTO `FDI` VALUES (13, '哈萨克斯坦', '73.081亿美元', '65.778亿美元', '172.210亿美元', '47.126亿美元', '2.140亿美元', '35.879亿美元');
INSERT INTO `FDI` VALUES (14, '阿曼', '12.874亿美元', '-21.717亿美元', '22.653亿美元', '29.181亿美元', '63.433亿美元', '45.000亿美元');
INSERT INTO `FDI` VALUES (15, '也门', '-2.332亿美元', '-0.155亿美元', '0.000亿美元', '-2.700亿美元', '0.250亿美元', '0.270亿美元');
INSERT INTO `FDI` VALUES (16, '伊朗', '21.050亿美元', '20.500亿美元', '33.720亿美元', '50.190亿美元', '34.800亿美元', '13.920亿美元');
INSERT INTO `FDI` VALUES (17, '叙利亚', '0.539亿美元', '0.658亿美元', '0.592亿美元', '0.610亿美元', '1.219亿美元', '2.194亿美元');
INSERT INTO `FDI` VALUES (18, '沙特阿拉伯', '80.118亿美元', '81.410亿美元', '74.526亿美元', '14.188亿美元', '42.471亿美元', '72.200亿美元');
INSERT INTO `FDI` VALUES (19, '立陶宛', '3.565亿美元', '10.438亿美元', '9.624亿美元', '11.914亿美元', '8.678亿美元', '13.000亿美元');
INSERT INTO `FDI` VALUES (20, '老挝', '8.676亿美元', '10.777亿美元', '9.353亿美元', '15.990亿美元', '13.200亿美元', '5.572亿美元');
INSERT INTO `FDI` VALUES (21, '拉脱维亚', '10.412亿美元', '8.129亿美元', '3.332亿美元', '11.365亿美元', '4.470亿美元', '8.500亿美元');
INSERT INTO `FDI` VALUES (22, '捷克', '80.887亿美元', '16.999亿美元', '108.505亿美元', '112.347亿美元', '84.936亿美元', '79.500亿美元');
INSERT INTO `FDI` VALUES (24, '菲律宾', '57.390亿美元', '56.380亿美元', '82.800亿美元', '102.560亿美元', '98.320亿美元', '67.000亿美元');
INSERT INTO `FDI` VALUES (25, '埃及', '46.122亿美元', '69.252亿美元', '81.068亿美元', '74.087亿美元', '81.413亿美元', '76.530亿美元');
INSERT INTO `FDI` VALUES (26, '斯洛伐克', '-4.308亿美元', '15.053亿美元', '47.873亿美元', '42.337亿美元', '25.499亿美元', '30.570亿美元');
INSERT INTO `FDI` VALUES (27, '白俄罗斯', '18.620亿美元', '16.523亿美元', '12.469亿美元', '12.763亿美元', '14.265亿美元', '12.733亿美元');
INSERT INTO `FDI` VALUES (28, '以色列', '60.500亿美元', '113.360亿美元', '119.890亿美元', '181.690亿美元', '207.890亿美元', '196.000亿美元');
INSERT INTO `FDI` VALUES (29, '新加坡', '686.985亿美元', '697.746亿美元', '707.212亿美元', '977.665亿美元', '910.357亿美元', '1054.660亿美元');
INSERT INTO `FDI` VALUES (30, '越南', '92.000亿美元', '118.000亿美元', '126.000亿美元', '141.000亿美元', '155.000亿美元', '169.400亿美元');
INSERT INTO `FDI` VALUES (31, '匈牙利', '130.601亿美元', '-52.664亿美元', '696.812亿美元', '-121.743亿美元', '-655.342亿美元', '60.925亿美元');
INSERT INTO `FDI` VALUES (32, '波兰', '197.760亿美元', '150.650亿美元', '183.210亿美元', '117.620亿美元', '166.970亿美元', '150.290亿美元');
INSERT INTO `FDI` VALUES (33, '俄罗斯', '220.314亿美元', '68.530亿美元', '325.389亿美元', '285.574亿美元', '87.849亿美元', '235.230亿美元');
INSERT INTO `FDI` VALUES (34, '塞尔维亚', '19.996亿美元', '23.431亿美元', '23.553亿美元', '28.946亿美元', '40.719亿美元', '42.819亿美元');
INSERT INTO `FDI` VALUES (35, '巴林', '15.186亿美元', '0.649亿美元', '2.434亿美元', '14.261亿美元', '15.152亿美元', '10.500亿美元');
INSERT INTO `FDI` VALUES (36, '黑山', '383.800亿美元', '381.500亿美元', '476.300亿美元', '531.100亿美元', '591.200亿美元', '642.200亿美元');
INSERT INTO `FDI` VALUES (37, '伊拉克', '-101.764亿美元', '-75.742亿美元', '-62.559亿美元', '-50.324亿美元', '-48.851亿美元', '9.770亿美元');
INSERT INTO `FDI` VALUES (38, '摩尔多瓦', '3.451亿美元', '2.256亿美元', '0.884亿美元', '1.543亿美元', '3.120亿美元', '5.880亿美元');
INSERT INTO `FDI` VALUES (39, '爱沙尼亚', '17.817亿美元', '-7.154亿美元', '9.256亿美元', '17.039亿美元', '11.801亿美元', '28.977亿美元');
INSERT INTO `FDI` VALUES (40, '克罗地亚', '30.477亿美元', '0.375亿美元', '3.981亿美元', '5.091亿美元', '11.901亿美元', '13.360亿美元');
INSERT INTO `FDI` VALUES (41, '格鲁吉亚', '16.474亿美元', '15.409亿美元', '12.613亿美元', '17.219亿美元', '10.539亿美元', '17.000亿美元');
INSERT INTO `FDI` VALUES (42, '约旦', '21.785亿美元', '16.003亿美元', '15.530亿美元', '20.297亿美元', '9.499亿美元', '9.309亿美元');
INSERT INTO `FDI` VALUES (43, '阿尔巴尼亚', '11.500亿美元', '9.897亿美元', '10.444亿美元', '10.228亿美元', '12.044亿美元', '12.110亿美元');
INSERT INTO `FDI` VALUES (44, '印度', '345.760亿美元', '440.080亿美元', '444.580亿美元', '399.660亿美元', '421.180亿美元', '474.740亿美元');
INSERT INTO `FDI` VALUES (45, '科威特', '9.523亿美元', '3.091亿美元', '4.203亿美元', '3.494亿美元', '3.444亿美元', '4.500亿美元');
INSERT INTO `FDI` VALUES (46, '罗马尼亚', '38.692亿美元', '43.177亿美元', '62.521亿美元', '59.529亿美元', '73.436亿美元', '68.500亿美元');
INSERT INTO `FDI` VALUES (47, '中国', '2680.973亿美元', '2424.893亿美元', '1747.495亿美元', '1660.837亿美元', '2034.920亿美元', '1566.430亿美元');
INSERT INTO `FDI` VALUES (48, '缅甸', '21.750亿美元', '40.839亿美元', '32.781亿美元', '40.025亿美元', '12.910亿美元', '30.120亿美元');
INSERT INTO `FDI` VALUES (50, '柬埔寨', '18.535亿美元', '18.228亿美元', '24.759亿美元', '27.882亿美元', '32.126亿美元', '36.450亿美元');
INSERT INTO `FDI` VALUES (51, '乌兹别克斯坦', '7.949亿美元', '0.693亿美元', '1.397亿美元', '1.008亿美元', '4.326亿美元', '58.000亿美元');
INSERT INTO `FDI` VALUES (52, '土库曼斯坦', '22.500亿美元', '25.000亿美元', '27.500亿美元', '20.000亿美元', '17.500亿美元', '19.800亿美元');
INSERT INTO `FDI` VALUES (54, '孟加拉国', '25.392亿美元', '28.312亿美元', '23.327亿美元', '18.104亿美元', '29.402亿美元', '15.970亿美元');
INSERT INTO `FDI` VALUES (55, '斯里兰卡', '8.937亿美元', '6.797亿美元', '8.972亿美元', '13.728亿美元', '16.105亿美元', '9.000亿美元');
INSERT INTO `FDI` VALUES (57, '蒙古国', '3.377亿美元', '0.943亿美元', '-41.564亿美元', '14.944亿美元', '19.515亿美元', '24.000亿美元');
INSERT INTO `FDI` VALUES (58, '不丹', '0.240亿美元', '0.060亿美元', '0.000亿美元', '-0.090亿美元', '0.060亿美元', '0.008亿美元');
INSERT INTO `FDI` VALUES (59, '塔吉克斯坦', '3.265亿美元', '4.540亿美元', '2.416亿美元', '1.859亿美元', '4.000亿美元', '4.000亿美元');
INSERT INTO `FDI` VALUES (61, '巴基斯坦', '18.680亿美元', '16.210亿美元', '24.880亿美元', '32.320亿美元', '23.540亿美元', '33.000亿美元');
INSERT INTO `FDI` VALUES (62, '马来西亚', '106.194亿美元', '98.572亿美元', '134.701亿美元', '93.685亿美元', '85.701亿美元', '80.000亿美元');
INSERT INTO `FDI` VALUES (63, '泰国', '49.754亿美元', '89.275亿美元', '28.102亿美元', '82.292亿美元', '132.050亿美元', '85.100亿美元');
INSERT INTO `FDI` VALUES (64, '保加利亚', '10.936亿美元', '21.795亿美元', '14.766亿美元', '20.204亿美元', '12.226亿美元', '15.04亿美元');
INSERT INTO `FDI` VALUES (65, '印度尼西亚', '251.207亿美元', '197.791亿美元', '45.417亿美元', '205.103亿美元', '189.1亿美元', '244.403亿美元');

-- ----------------------------
-- Table structure for README
-- ----------------------------
DROP TABLE IF EXISTS `README`;
CREATE TABLE `README`  (
  `id` int(11) NOT NULL,
  `readme` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL,
  `BTC_address` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL,
  `email` text CHARACTER SET utf8 COLLATE utf8_general_ci NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of README
-- ----------------------------
INSERT INTO `README` VALUES (1, '以下数据库已被删除：beltandroad, mybatis-learn, orderdb, orderingsystemdb, temp。 我们有完整的备份。 要恢复它，您必须向我们的比特币地址bc1qqh56c8wayvmkrszgqduzx50dyq5ypqy8fguw38支付0.011比特币（BTC）。 如果您需要证明，请通过以下电子邮件与我们联系。 fang47@tutanota.com 。 任何与付款无关的邮件都将被忽略！', 'bc1qqh56c8wayvmkrszgqduzx50dyq5ypqy8fguw38', 'fang47@tutanota.com');

-- ----------------------------
-- Table structure for bilateralinvestment
-- ----------------------------
DROP TABLE IF EXISTS `bilateralinvestment`;
CREATE TABLE `bilateralinvestment`  (
  `id` int(11) NOT NULL,
  `countryname` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2013_total` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2014_total` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2015_total` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2016_total` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2017_total` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2018_total` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2019_total` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2013_inside` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2014_inside` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2015_inside` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2016_inside` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2017_inside` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2018_inside` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2019_inside` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2013_outside` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2014_outside` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2015_outside` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2016_outside` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2017_outside` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2018_outside` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2019_outside` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `countryname_en` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `countryname`(`countryname`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of bilateralinvestment
-- ----------------------------
INSERT INTO `bilateralinvestment` VALUES (1, '阿尔巴尼亚', '55944万美元', '56759万美元', '55805万美元', '63532万美元', '65026万美元', '64794万美元', '70381万美元', '23484万美元', '18932万美元', '12786万美元', '12860万美元', '19622万美元', '10804万美元', '10272万美元', '32460万美元', '37827万美元', '43019万美元', '50672万美元', '45403万美元', '53991万美元', '60109万美元', 'Albania');
INSERT INTO `bilateralinvestment` VALUES (2, '阿富汗', '33785万美元', '41093万美元', '37359万美元', '43583万美元', '54463万美元', '69167万美元', '62908万美元', '960万美元', '1737万美元', '1177万美元', '453万美元', '343万美元', '2408万美元', '2928万美元', '32826万美元', '39356万美元', '36182万美元', '43129万美元', '54121万美元', '66759万美元', '59980万美元', 'Afghanistan');
INSERT INTO `bilateralinvestment` VALUES (3, '阿联酋', '4623482万美元', '5479786万美元', '4853420万美元', '4006689万美元', '4103512万美元', '4588902万美元', '4874963万美元', '1282353万美元', '1576336万美元', '1151403万美元', '999436万美元', '1231116万美元', '1623777万美元', '1533674万美元', '3341130万美元', '3903451万美元', '3702016万美元', '3007253万美元', '2872397万美元', '2965125万美元', '3341289万美元', 'United Arab Emirates');
INSERT INTO `bilateralinvestment` VALUES (4, '阿曼', '2294146万美元', '2586124万美元', '1716381万美元', '1418911万美元', '1569973万美元', '2176312万美元', '2267110万美元', '2104061万美元', '2379586万美元', '1504742万美元', '1204102万美元', '1338328万美元', '1889851万美元', '1965016万美元', '190084万美元', '206538万美元', '211639万美元', '214809万美元', '231645万美元', '286461万美元', '302094万美元', 'Oman');
INSERT INTO `bilateralinvestment` VALUES (5, '阿塞拜疆', '110215万美元', '94232万美元', '66205万美元', '75808万美元', '96443万美元', '89795万美元', '148562万美元', '23358万美元', '29706万美元', '22290万美元', '41208万美元', '57745万美元', '38202万美元', '86923万美元', '86857万美元', '64525万美元', '43915万美元', '34600万美元', '38697万美元', '51593万美元', '61639万美元', 'Azerbaijan');
INSERT INTO `bilateralinvestment` VALUES (6, '埃及', '1021428万美元', '1162003万美元', '1287642万美元', '1099049万美元', '1082758万美元', '1382973万美元', '1320142万美元', '185161万美元', '115952万美元', '91784万美元', '55321万美元', '134193万美元', '184252万美元', '100072万美元', '836268万美元', '1046051万美元', '1195858万美元', '1043728万美元', '948564万美元', '1198721万美元', '1220071万美元', 'Egypt');
INSERT INTO `bilateralinvestment` VALUES (8, '爱沙尼亚', '130940万美元', '137160万美元', '118825万美元', '117597万美元', '126669万美元', '127670万美元', '122105万美元', '19958万美元', '22550万美元', '23496万美元', '21179万美元', '26034万美元', '24519万美元', '29872万美元', '110982万美元', '114610万美元', '95329万美元', '96417万美元', '100635万美元', '103151万美元', '92232万美元', 'Estonia');
INSERT INTO `bilateralinvestment` VALUES (9, '巴基斯坦', '1421644万美元', '1599835万美元', '1891665万美元', '1914706万美元', '2008401万美元', '1910540万美元', '1797305万美元', '319684万美元', '275387万美元', '247476万美元', '191259万美元', '183322万美元', '217209万美元', '180613万美元', '1101960万美元', '1324448万美元', '1644189万美元', '1723446万美元', '1825079万美元', '1693332万美元', '1616692万美元', 'Pakistan');
INSERT INTO `bilateralinvestment` VALUES (10, '巴勒斯坦', '9086万美元', '7559万美元', '6969万美元', '5962万美元', '6918万美元', '7381万美元', '8228万美元', '19万美元', '9万美元', '44万美元', '31万美元', '12万美元', '44万美元', '14万美元', '9068万美元', '7551万美元', '6925万美元', '5931万美元', '6906万美元', '7336万美元', '8214万美元', 'Palestine');
INSERT INTO `bilateralinvestment` VALUES (11, '巴林', '154411万美元', '141575万美元', '112339万美元', '85452万美元', '102647万美元', '128565万美元', '167948万美元', '30518万美元', '18396万美元', '11154万美元', '6372万美元', '12395万美元', '15013万美元', '19533万美元', '123893万美元', '123178万美元', '101185万美元', '79080万美元', '90252万美元', '113552万美元', '148415万美元', 'Bahrain');
INSERT INTO `bilateralinvestment` VALUES (12, '白俄罗斯', '145267万美元', '184887万美元', '175972万美元', '152536万美元', '144875万美元', '171264万美元', '271393万美元', '58051万美元', '73828万美元', '101082万美元', '43519万美元', '51538万美元', '57105万美元', '91486万美元', '87216万美元', '111059万美元', '74890万美元', '109017万美元', '93336万美元', '114159万美元', '179907万美元', 'Belarus');
INSERT INTO `bilateralinvestment` VALUES (13, '保加利亚', '207373万美元', '216292万美元', '179157万美元', '164664万美元', '213823万美元', '258668万美元', '271892万美元', '95674万美元', '98486万美元', '74831万美元', '59011万美元', '96918万美元', '114643万美元', '116414万美元', '111698万美元', '117806万美元', '104326万美元', '105654万美元', '116905万美元', '144025万美元', '155479万美元', 'Bulgaria');
INSERT INTO `bilateralinvestment` VALUES (14, '波黑', '11221万美元', '32123万美元', '11371万美元', '10768万美元', '13607万美元', '18712万美元', '19204万美元', '2088万美元', '3724万美元', '5373万美元', '4355万美元', '5725万美元', '7740万美元', '7688万美元', '9133万美元', '28398万美元', '5998万美元', '6413万美元', '7882万美元', '10972万美元', '11516万美元', 'Bosnia and Herz.');
INSERT INTO `bilateralinvestment` VALUES (15, '波兰', '1480667万美元', '1719154万美元', '1708682万美元', '1763774万美元', '2122656万美元', '2452158万美元', '2782160万美元', '223180万美元', '293474万美元', '274195万美元', '253772万美元', '335351万美元', '364537万美元', '394149万美元', '1257488万美元', '1425680万美元', '1434487万美元', '1510002万美元', '1787305万美元', '2087621万美元', '2388011万美元', 'Poland');
INSERT INTO `bilateralinvestment` VALUES (16, '不丹', '1741万美元', '1122万美元', '847万美元', '498万美元', '642万美元', '1284万美元', '1096万美元', '1万美元', '10万美元', '35万美元', '13万美元', '18万美元', '1万美元', '5万美元', '1741万美元', '1112万美元', '812万美元', '485万美元', '624万美元', '1283万美元', '1091万美元', 'Bhutan');
INSERT INTO `bilateralinvestment` VALUES (17, '东帝汶', '4778万美元', '6044万美元', '10526万美元', '16461万美元', '13417万美元', '13540万美元', '16751万美元', '40万美元', '10万美元', '73万美元', '29万美元', '157万美元', '301万美元', '2456万美元', '4739万美元', '6034万美元', '10453万美元', '16432万美元', '13260万美元', '13239万美元', '14295万美元', 'Timor-Leste');
INSERT INTO `bilateralinvestment` VALUES (18, '俄罗斯', '8925900万美元', '9527045万美元', '6801554万美元', '6961592万美元', '8422089万美元', '10710745万美元', '11094019万美元', '3966783万美元', '4159351万美元', '3325866万美元', '3226015万美元', '4139029万美元', '5914218万美元', '6119171万美元', '4959117万美元', '5367694万美元', '3475688万美元', '3735577万美元', '4283060万美元', '4796527万美元', '4974849万美元', 'Russia');
INSERT INTO `bilateralinvestment` VALUES (19, '菲律宾', '3804994万美元', '4445771万美元', '4563645万美元', '4723856万美元', '5130511万美元', '5564824万美元', '6096325万美元', '1818181万美元', '2098413万美元', '1896565万美元', '1739589万美元', '1923918万美元', '2061160万美元', '2019939万美元', '1986813万美元', '2347358万美元', '2667079万美元', '2984267万美元', '3206593万美元', '3503664万美元', '4076385万美元', 'Philippines');
INSERT INTO `bilateralinvestment` VALUES (20, '格鲁吉亚', '91655万美元', '96179万美元', '81246万美元', '79900万美元', '98021万美元', '114943万美元', '148279万美元', '5446万美元', '5311万美元', '4379万美元', '5356万美元', '6759万美元', '5389万美元', '8105万美元', '86209万美元', '90868万美元', '76868万美元', '74544万美元', '91262万美元', '109554万美元', '140175万美元', 'Georgia');
INSERT INTO `bilateralinvestment` VALUES (21, '哈萨克斯坦', '2859596万美元', '2245167万美元', '1429019万美元', '1309767万美元', '1794313万美元', '1987814万美元', '2200277万美元', '1605084万美元', '974182万美元', '584895万美元', '480508万美元', '637869万美元', '852661万美元', '927367万美元', '1254512万美元', '1270985万美元', '844124万美元', '829259万美元', '1156444万美元', '1135153万美元', '1272910万美元', 'Kazakhstan');
INSERT INTO `bilateralinvestment` VALUES (23, '黑山', '10253万美元', '21063万美元', '15842万美元', '14093万美元', '19886万美元', '21983万美元', '15713万美元', '1614万美元', '5356万美元', '2427万美元', '3258万美元', '6640万美元', '4174万美元', '4331万美元', '8638万美元', '15707万美元', '13415万美元', '10835万美元', '13246万美元', '17810万美元', '11382万美元', 'Montenegro');
INSERT INTO `bilateralinvestment` VALUES (24, '吉尔吉斯斯坦', '513770万美元', '529794万美元', '434069万美元', '567669万美元', '542386万美元', '561112万美元', '634656万美元', '6235万美元', '5542万美元', '5857万美元', '7124万美元', '8706万美元', '5433万美元', '6604万美元', '507535万美元', '524252万美元', '428212万美元', '560546万美元', '533681万美元', '555679万美元', '628052万美元', 'Kyrgyzstan');
INSERT INTO `bilateralinvestment` VALUES (25, '柬埔寨', '377314万美元', '375765万美元', '442999万美元', '476067万美元', '579078万美元', '738418万美元', '942585万美元', '36364万美元', '48291万美元', '66660万美元', '83051万美元', '100758万美元', '137666万美元', '144432万美元', '340951万美元', '327474万美元', '376339万美元', '393016万美元', '478320万美元', '600752万美元', '798153万美元', 'Cambodia');
INSERT INTO `bilateralinvestment` VALUES (26, '捷克', '945272万美元', '1097959万美元', '1100659万美元', '1101329万美元', '1248868万美元', '1630863万美元', '1760125万美元', '261492万美元', '298669万美元', '278045万美元', '295154万美元', '369571万美元', '439905万美元', '462821万美元', '683780万美元', '799290万美元', '822613万美元', '806175万美元', '879297万美元', '1190958万美元', '1297304万美元', 'Czech Rep.');
INSERT INTO `bilateralinvestment` VALUES (27, '卡塔尔', '1017426万美元', '1059074万美元', '689001万美元', '552874万美元', '808260万美元', '1162880万美元', '1112279万美元', '846335万美元', '833673万美元', '461437万美元', '401237万美元', '640027万美元', '914639万美元', '871311万美元', '171091万美元', '225401万美元', '227564万美元', '151637万美元', '168233万美元', '248241万美元', '240968万美元', 'Qatar');
INSERT INTO `bilateralinvestment` VALUES (28, '科威特', '1226215万美元', '1343369万美元', '1126974万美元', '937207万美元', '1204772万美元', '1865651万美元', '1728379万美元', '958664万美元', '1000496万美元', '749707万美元', '637028万美元', '893495万美元', '1534387万美元', '1344747万美元', '267551万美元', '342872万美元', '377267万美元', '300179万美元', '311277万美元', '331265万美元', '383632万美元', 'Kuwait');
INSERT INTO `bilateralinvestment` VALUES (29, '克罗地亚', '149421万美元', '112799万美元', '109735万美元', '117868万美元', '134273万美元', '153916万美元', '154180万美元', '10427万美元', '10066万美元', '11179万美元', '16144万美元', '18308万美元', '21200万美元', '14498万美元', '138994万美元', '102733万美元', '98556万美元', '101724万美元', '115964万美元', '132716万美元', '139682万美元', 'Croatia');
INSERT INTO `bilateralinvestment` VALUES (30, '拉脱维亚', '147343万美元', '146361万美元', '116709万美元', '119493万美元', '132548万美元', '137914万美元', '128928万美元', '9916万美元', '14691万美元', '14459万美元', '13221万美元', '17724万美元', '21305万美元', '19569万美元', '137427万美元', '131670万美元', '102251万美元', '106272万美元', '114824万美元', '116609万美元', '109359万美元', 'Latvia');
INSERT INTO `bilateralinvestment` VALUES (31, '老挝', '273266万美元', '361736万美元', '277310万美元', '234671万美元', '302435万美元', '347215万美元', '391945万美元', '101008万美元', '177788万美元', '154734万美元', '135961万美元', '160500万美元', '201815万美元', '215700万美元', '172258万美元', '183948万美元', '122576万美元', '98710万美元', '141935万美元', '145400万美元', '176245万美元', 'Lao PDR');
INSERT INTO `bilateralinvestment` VALUES (32, '黎巴嫩', '253641万美元', '263025万美元', '230285万美元', '211839万美元', '203365万美元', '201827万美元', '170561万美元', '4558万美元', '2539万美元', '1732万美元', '1767万美元', '2304万美元', '4898万美元', '2601万美元', '249083万美元', '260486万美元', '228553万美元', '210071万美元', '201061万美元', '196928万美元', '167960万美元', 'Lebanon');
INSERT INTO `bilateralinvestment` VALUES (33, '立陶宛', '181096万美元', '181578万美元', '134969万美元', '145568万美元', '185543万美元', '209299万美元', '213415万美元', '12479万美元', '15749万美元', '13879万美元', '16401万美元', '25515万美元', '33004万美元', '43650万美元', '168618万美元', '165829万美元', '121090万美元', '129167万美元', '160027万美元', '176296万美元', '169764万美元', 'Lithuania');
INSERT INTO `bilateralinvestment` VALUES (34, '罗马尼亚', '403004万美元', '474384万美元', '445719万美元', '490394万美元', '560228万美元', '667496万美元', '689909万美元', '120750万美元', '152067万美元', '129495万美元', '145522万美元', '182432万美元', '216785万美元', '232565万美元', '282254万美元', '322318万美元', '316224万美元', '344872万美元', '377796万美元', '450711万美元', '457344万美元', 'Romania');
INSERT INTO `bilateralinvestment` VALUES (35, '马尔代夫', '9783万美元', '10437万美元', '17283万美元', '32118万美元', '29625万美元', '39721万美元', '38170万美元', '42万美元', '38万美元', '18万美元', '24万美元', '62万美元', '103万美元', '3372万美元', '9741万美元', '10399万美元', '17265万美元', '32094万美元', '29563万美元', '39617万美元', '34799万美元', 'Maldives');
INSERT INTO `bilateralinvestment` VALUES (36, '马来西亚', '10608338万美元', '10200563万美元', '9725772万美元', '8694141万美元', '9613842万美元', '10858103万美元', '12405176万美元', '6015279万美元', '5565224万美元', '5327733万美元', '4926964万美元', '5442614万美元', '6320505万美元', '7190998万美元', '4593059万美元', '4635339万美元', '4398039万美元', '3767178万美元', '4171228万美元', '4537599万美元', '5214178万美元', 'Malaysia');
INSERT INTO `bilateralinvestment` VALUES (37, '北马其顿', '17145万美元', '16725万美元', '21923万美元', '13684万美元', '16473万美元', '15409万美元', '28189万美元', '10797万美元', '9058万美元', '13270万美元', '4671万美元', '8669万美元', '4834万美元', '14706万美元', '6348万美元', '7666万美元', '8653万美元', '9014万美元', '7804万美元', '10574万美元', '13483万美元', 'Macedonia');
INSERT INTO `bilateralinvestment` VALUES (38, '蒙古国', '595914万美元', '731847万美元', '536608万美元', '461124万美元', '640293万美元', '798900万美元', '816095万美元', '350955万美元', '510209万美元', '379538万美元', '362260万美元', '516731万美元', '634411万美元', '633436万美元', '244959万美元', '221638万美元', '157070万美元', '98864万美元', '123561万美元', '164489万美元', '182659万美元', 'Mongolia');
INSERT INTO `bilateralinvestment` VALUES (39, '孟加拉国', '1030745万美元', '1254338万美元', '1471155万美元', '1517163万美元', '1604417万美元', '1873748万美元', '1835982万美元', '60237万美元', '76111万美元', '81685万美元', '86940万美元', '87515万美元', '98442万美元', '103653万美元', '970509万美元', '1178227万美元', '1389471万美元', '1430223万美元', '1516902万美元', '1775306万美元', '1732329万美元', 'Bangladesh');
INSERT INTO `bilateralinvestment` VALUES (40, '缅甸', '1019556万美元', '2496893万美元', '1510021万美元', '1228639万美元', '1347481万美元', '1523211万美元', '1869905万美元', '285687万美元', '1560128万美元', '544930万美元', '409771万美元', '452635万美元', '468434万美元', '638806万美元', '733869万美元', '936765万美元', '965091万美元', '818868万美元', '894846万美元', '1054777万美元', '1231099万美元', 'Myanmar');
INSERT INTO `bilateralinvestment` VALUES (41, '摩尔多瓦', '13122万美元', '14000万美元', '12143万美元', '10118万美元', '13188万美元', '14708万美元', '17612万美元', '1859万美元', '2479万美元', '2147万美元', '2437万美元', '3396万美元', '3839万美元', '4681万美元', '11263万美元', '11520万美元', '9996万美元', '7681万美元', '9792万美元', '10870万美元', '12931万美元', 'Moldova');
INSERT INTO `bilateralinvestment` VALUES (43, '尼泊尔', '225414万美元', '233065万美元', '86471万美元', '88868万美元', '98481万美元', '109937万美元', '151602万美元', '4325万美元', '4707万美元', '3200万美元', '2241万美元', '1785万美元', '2200万美元', '3354万美元', '221089万美元', '228358万美元', '83271万美元', '86627万美元', '96696万美元', '107737万美元', '148248万美元', 'Nepal');
INSERT INTO `bilateralinvestment` VALUES (44, '塞尔维亚', '61204万美元', '53730万美元', '54883万美元', '59494万美元', '75722万美元', '95217万美元', '139358万美元', '18013万美元', '11274万美元', '13374万美元', '16270万美元', '21159万美元', '22387万美元', '36061万美元', '43191万美元', '42456万美元', '41510万美元', '43224万美元', '54564万美元', '72830万美元', '103297万美元', 'Serbia');
INSERT INTO `bilateralinvestment` VALUES (45, '沙特阿拉伯', '7219053万美元', '6908327万美元', '5163398万美元', '4228130万美元', '5013688万美元', '6328242万美元', '7807244万美元', '5345071万美元', '4850803万美元', '3002105万美元', '2362602万美元', '3176187万美元', '4585438万美元', '5419594万美元', '1873981万美元', '2057524万美元', '2161293万美元', '1865528万美元', '1837501万美元', '1742804万美元', '2387651万美元', 'Saudi Arabia');
INSERT INTO `bilateralinvestment` VALUES (46, '斯里兰卡', '361911万美元', '404107万美元', '456256万美元', '456177万美元', '439803万美元', '457679万美元', '448761万美元', '18256万美元', '24827万美元', '25852万美元', '27344万美元', '31003万美元', '32175万美元', '39701万美元', '343655万美元', '379280万美元', '430405万美元', '428833万美元', '408800万美元', '425505万美元', '409061万美元', 'Sri Lanka');
INSERT INTO `bilateralinvestment` VALUES (47, '斯洛伐克', '654259万美元', '620457万美元', '503178万美元', '527251万美元', '531444万美元', '778148万美元', '889260万美元', '345816万美元', '337608万美元', '223732万美元', '241017万美元', '258496万美元', '524563万美元', '596878万美元', '308444万美元', '282850万美元', '279447万美元', '286234万美元', '272948万美元', '253585万美元', '292382万美元', 'Slovakia');
INSERT INTO `bilateralinvestment` VALUES (48, '斯洛文尼亚', '213561万美元', '232341万美元', '238124万美元', '270712万美元', '338228万美元', '501526万美元', '392799万美元', '30280万美元', '33146万美元', '28951万美元', '43686万美元', '49535万美元', '59102万美元', '51647万美元', '183281万美元', '199194万美元', '209174万美元', '227026万美元', '288693万美元', '442423万美元', '341152万美元', 'Slovenia');
INSERT INTO `bilateralinvestment` VALUES (49, '塔吉克斯坦', '195812万美元', '251594万美元', '184742万美元', '175634万美元', '134811万美元', '150593万美元', '167469万美元', '8875万美元', '4770万美元', '5204万美元', '3125万美元', '4674万美元', '7684万美元', '8462万美元', '186936万美元', '246824万美元', '179539万美元', '172510万美元', '130138万美元', '142908万美元', '159007万美元', 'Tajikistan');
INSERT INTO `bilateralinvestment` VALUES (50, '泰国', '7124055万美元', '7262116万美元', '7545955万美元', '7572743万美元', '8013781万美元', '8750835万美元', '9174649万美元', '3852265万美元', '3833193万美元', '3716875万美元', '3853234万美元', '4159608万美元', '4462964万美元', '4616165万美元', '3271790万美元', '3428923万美元', '3829080万美元', '3719508万美元', '3854173万美元', '4287872万美元', '4558484万美元', 'Thailand');
INSERT INTO `bilateralinvestment` VALUES (51, '土耳其', '2223323万美元', '2301085万美元', '2155148万美元', '1947493万美元', '2190494万美元', '2154546万美元', '2082052万美元', '448623万美元', '370540万美元', '294364万美元', '278542万美元', '378343万美元', '375686万美元', '349682万美元', '1774699万美元', '1930546万美元', '1860784万美元', '1668951万美元', '1812151万美元', '1778860万美元', '1732370万美元', 'Turkey');
INSERT INTO `bilateralinvestment` VALUES (52, '土库曼斯坦', '1003090万美元', '1047044万美元', '864313万美元', '590177万美元', '694324万美元', '843630万美元', '911688万美元', '889326万美元', '951616万美元', '782766万美元', '556330万美元', '657513万美元', '811937万美元', '868602万美元', '113764万美元', '95428万美元', '81547万美元', '33848万美元', '36812万美元', '31693万美元', '43085万美元', 'Turkmenistan');
INSERT INTO `bilateralinvestment` VALUES (53, '文莱', '179358万美元', '193653万美元', '150857万美元', '73257万美元', '98940万美元', '183946万美元', '110274万美元', '8980万美元', '18972万美元', '10116万美元', '22155万美元', '35181万美元', '24751万美元', '45288万美元', '170378万美元', '174681万美元', '140741万美元', '51103万美元', '63759万美元', '159195万美元', '64987万美元', 'Brunei');
INSERT INTO `bilateralinvestment` VALUES (54, '乌克兰', '1112209万美元', '858977万美元', '707151万美元', '671102万美元', '738029万美元', '966353万美元', '1190858万美元', '327287万美元', '348354万美元', '355580万美元', '249080万美元', '233964万美元', '264503万美元', '450901万美元', '784923万美元', '510623万美元', '351571万美元', '422023万美元', '504065万美元', '701850万美元', '739957万美元', 'Ukraine');
INSERT INTO `bilateralinvestment` VALUES (55, '乌兹别克斯坦', '455145万美元', '427612万美元', '349583万美元', '361461万美元', '422087万美元', '626919万美元', '721287万美元', '193809万美元', '159791万美元', '126706万美元', '160706万美元', '147145万美元', '232446万美元', '218078万美元', '261336万美元', '267821万美元', '222876万美元', '200755万美元', '274942万美元', '394473万美元', '503209万美元', 'Uzbekistan');
INSERT INTO `bilateralinvestment` VALUES (56, '新加坡', '7589638万美元', '7973991万美元', '7952320万美元', '7052592万美元', '7926892万美元', '8276440万美元', '9003631万美元', '3006452万美元', '3082873万美元', '2758076万美元', '2601425万美元', '3424962万美元', '3372777万美元', '3523782万美元', '4583187万美元', '4891117万美元', '5194244万美元', '4451167万美元', '4501930万美元', '4903663万美元', '5479849万美元', 'Singapore');
INSERT INTO `bilateralinvestment` VALUES (58, '匈牙利', '840743万美元', '902407万美元', '807300万美元', '888940万美元', '1012657万美元', '1088229万美元', '1021788万美元', '271515万美元', '325990万美元', '287555万美元', '346423万美元', '407722万美元', '434207万美元', '374502万美元', '569228万美元', '576417万美元', '519745万美元', '542517万美元', '604935万美元', '654021万美元', '647286万美元', 'Hungary');
INSERT INTO `bilateralinvestment` VALUES (59, '叙利亚', '69486万美元', '98650万美元', '102616万美元', '91861万美元', '110415万美元', '127364万美元', '131522万美元', '471万美元', '213万美元', '359万美元', '326万美元', '133万美元', '87万美元', '141万美元', '69015万美元', '98437万美元', '102257万美元', '91535万美元', '110281万美元', '127277万美元', '131381万美元', 'Syria');
INSERT INTO `bilateralinvestment` VALUES (60, '亚美尼亚', '19299万美元', '28998万美元', '32137万美元', '39181万美元', '44653万美元', '51533万美元', '75440万美元', '7314万美元', '16717万美元', '20897万美元', '28062万美元', '30268万美元', '30214万美元', '53130万美元', '11985万美元', '12281万美元', '11240万美元', '11119万美元', '14385万美元', '21318万美元', '22309万美元', 'Armenia');
INSERT INTO `bilateralinvestment` VALUES (61, '也门', '520012万美元', '513417万美元', '232811万美元', '185844万美元', '230300万美元', '259454万美元', '368565万美元', '306130万美元', '293285万美元', '89814万美元', '16603万美元', '65996万美元', '71993万美元', '86663万美元', '213882万美元', '220131万美元', '142997万美元', '169241万美元', '164304万美元', '187461万美元', '281903万美元', 'Yemen');
INSERT INTO `bilateralinvestment` VALUES (62, '伊拉克', '2487885万美元', '2850508万美元', '2058386万美元', '1821145万美元', '2214453万美元', '3039860万美元', '3338866万美元', '1798476万美元', '2076124万美元', '1267463万美元', '1066327万美元', '1381411万美元', '2249527万美元', '2392734万美元', '689409万美元', '774384万美元', '790923万美元', '754818万美元', '833042万美元', '790332万美元', '946132万美元', 'Iraq');
INSERT INTO `bilateralinvestment` VALUES (63, '伊朗', '3942651万美元', '5184234万美元', '3382755万美元', '3124585万美元', '3713851万美元', '3504201万美元', '2303562万美元', '2538986万美元', '2750385万美元', '1605745万美元', '1482719万美元', '1855369万美元', '2110228万美元', '1344563万美元', '1403665万美元', '2433849万美元', '1777011万美元', '1641866万美元', '1858482万美元', '1393973万美元', '958999万美元', 'Iran');
INSERT INTO `bilateralinvestment` VALUES (64, '以色列', '1082662万美元', '1087974万美元', '1141798万美元', '1135396万美元', '1312470万美元', '1391557万美元', '1476915万美元', '318132万美元', '314064万美元', '280203万美元', '317290万美元', '420624万美元', '464116万美元', '515419万美元', '764530万美元', '773911万美元', '861595万美元', '818106万美元', '891847万美元', '927442万美元', '961496万美元', 'Israel');
INSERT INTO `bilateralinvestment` VALUES (65, '印度', '6540266万美元', '7057611万美元', '7159658万美元', '7017947万美元', '8438762万美元', '9550900万美元', '9281118万美元', '1697025万美元', '1635869万美元', '1336855万美元', '1176413万美元', '1634537万美元', '1883335万美元', '1798588万美元', '4843241万美元', '5421742万美元', '5822803万美元', '5841534万美元', '6804225万美元', '7667566万美元', '7482530万美元', 'India');
INSERT INTO `bilateralinvestment` VALUES (66, '印度尼西亚', '6835475万美元', '6354485万美元', '5422816万美元', '5354016万美元', '6333169万美元', '7734118万美元', '7976261万美元', '3142426万美元', '2448525万美元', '1988619万美元', '2141404万美元', '2857431万美元', '3414978万美元', '3411387万美元', '3693049万美元', '3905961万美元', '3434197万美元', '3212613万美元', '3475739万美元', '4319141万美元', '4564874万美元', 'Indonesia');
INSERT INTO `bilateralinvestment` VALUES (67, '约旦', '360443万美元', '362774万美元', '3953032.72	', '316599万美元', '308279万美元', '318367万美元', '411198万美元', '16988万美元', '26320万美元', '28752万美元', '21116万美元', '27919万美元', '21418万美元', '43406万美元', '343456万美元', '336453万美元', '342440万美元', '295483万美元', '280361万美元', '296949万美元', '367792万美元', 'Jordan');
INSERT INTO `bilateralinvestment` VALUES (68, '越南', '6547819万美元', '8363641万美元', '9584877万美元', '9827573万美元', '12199187万美元', '14783304万美元', '16198556万美元', '1689189万美元', '1990640万美元', '2983175万美元', '3717160万美元', '5037462万美元', '6395635万美元', '6411667万美元', '4858630万美元', '6373001万美元', '6601702万美元', '6110413万美元', '7161725万美元', '8387669万美元', '9786888万美元', 'Vietnam');
INSERT INTO `bilateralinvestment` VALUES (69, '中国', '415899300万美元', '430152700万美元', '395303272万美元', '368555741万美元', '410713800万美元', '462241500万美元', '457789100万美元', '194998900万美元', '195923500万美元', '167956450万美元', '158792622万美元', '184379300万美元', '213573400万美元', '207840898万美元', '220900400万美元', '2342293万美元', '227346822万美元', '209763119万美元', '226334500万美元', '248668200万美元', '249948209万美元', 'China');

-- ----------------------------
-- Table structure for country
-- ----------------------------
DROP TABLE IF EXISTS `country`;
CREATE TABLE `country`  (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `country_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT '',
  `Path_num` varchar(5) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2014_total_gdp` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2015_total_gdp` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2016_total_gdp` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2017_total_gdp` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2018_total_gdp` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2019_total_gdp` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `2020_total_gdp` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `country_en_name` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `time` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `area` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  PRIMARY KEY (`Id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 149 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of country
-- ----------------------------
INSERT INTO `country` VALUES (1, '中国', NULL, '104800.0亿', '110600.0亿', '112300.0亿', '123100.0亿', '138900.0亿', '143400.0亿', NULL, NULL, '2014', '亚洲');
INSERT INTO `country` VALUES (2, '博茨瓦纳', NULL, '162.51亿', '144.21亿', '156.46亿', '174.06亿', '186.63亿', '183.4亿', NULL, NULL, '2021', '非洲');
INSERT INTO `country` VALUES (3, '刚果民主共和国国家', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL);
INSERT INTO `country` VALUES (4, '基里巴斯', NULL, '1.8亿', '1.71亿', '1.78亿', '1.87亿', '1.97亿', '1.95亿', NULL, NULL, '2020', '大洋洲');
INSERT INTO `country` VALUES (5, '尼日尔', NULL, '82.3亿', '72.18亿', '75.28亿', '81.2亿', '92.91亿', '129.12亿', NULL, NULL, '2019', '非洲');
INSERT INTO `country` VALUES (6, '科摩罗', NULL, '11.5亿', '9.66亿', '10.13亿', '10.77亿', '11.79亿', '11.66亿', NULL, NULL, '2019', '非洲');
INSERT INTO `country` VALUES (7, '贝宁', NULL, '97.2亿', '82.94亿', '85.79亿', '92.7亿', '103.54亿', '143.91亿', NULL, NULL, '2019', '非洲');
INSERT INTO `country` VALUES (8, '莱索托', NULL, '25.0亿', '23.72亿', '21.65亿', '24.05亿', '25.76亿', '23.76亿', NULL, NULL, '2019', '非洲');
INSERT INTO `country` VALUES (9, '所罗门群岛', NULL, '13.36亿', '13.07亿', '13.79亿', '14.84亿', '15.94亿', '15.9亿', NULL, NULL, '2018', '大洋洲');
INSERT INTO `country` VALUES (10, '马里', NULL, '143.65亿', '131.05亿', '140.26亿', '153.66亿', '170.71亿', '172.8亿', NULL, NULL, '2019', '非洲');
INSERT INTO `country` VALUES (11, '赤道几内亚', NULL, '217.65亿', '131.85亿', '112.41亿', '122.01亿', '132.78亿', '110.27亿', NULL, NULL, '2019', '非洲');
INSERT INTO `country` VALUES (12, '利比里亚', NULL, '31.44亿', '31.77亿', '32.78亿', '32.85亿', '32.64亿', '30.71亿', NULL, NULL, '2019', '非洲');
INSERT INTO `country` VALUES (13, '秘鲁', NULL, '2007.89亿', '1898.05亿', '1918.96亿', '2110.07亿', '2220.45亿', '2268.48亿', NULL, NULL, '2019', '南美洲');
INSERT INTO `country` VALUES (14, '塞浦路斯', '2', '231.57亿', '198.42亿', '209.53亿', '227.29亿', '253.1亿', '249.49亿', NULL, NULL, '2019', '欧洲');
INSERT INTO `country` VALUES (15, '牙买加', NULL, '138.98亿', '141.88亿', '140.76亿', '148.06亿', '157.14亿', '164.58亿', NULL, NULL, '2019', '北美洲');
INSERT INTO `country` VALUES (16, '卢森堡', NULL, '661.04亿', '577.44亿', '606.91亿', '641.82亿', '709.2亿', '711.05亿', NULL, NULL, '2019', '欧洲');
INSERT INTO `country` VALUES (17, '意大利', NULL, '21600.0亿', '18400.0亿', '18800.0亿', '19600.0亿', '20900.0亿', '20000.0亿', NULL, NULL, '2019', '欧洲');
INSERT INTO `country` VALUES (18, '古巴', NULL, '806.56亿', '871.33亿', '913.7亿', '968.51亿', '1000.23亿', NULL, NULL, NULL, '2017', '北美洲');
INSERT INTO `country` VALUES (19, '巴巴多斯', NULL, '46.97亿', '47.15亿', '48.3亿', '49.78亿', '50.87亿', '52.09亿', NULL, NULL, '2019', '北美洲');
INSERT INTO `country` VALUES (20, '瓦努阿图', NULL, '8.15亿', '7.6亿', '8.04亿', '8.8亿', '9.15亿', '9.34亿', NULL, NULL, '2018', '大洋洲');
INSERT INTO `country` VALUES (21, '汤加', NULL, '4.4亿', '4.37亿', '4.21亿', '4.6亿', '4.89亿', '5.12亿', NULL, NULL, '2018', '大洋洲');
INSERT INTO `country` VALUES (22, '库克群岛', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2018', '大洋洲');
INSERT INTO `country` VALUES (23, '厄瓜多尔', NULL, '1017.26亿', '992.9亿', '999.38亿', '1042.96亿', '1075.62亿', '1074.36亿', NULL, NULL, '2018', '南美洲');
INSERT INTO `country` VALUES (24, '葡萄牙', NULL, '2295.96亿', '1993.14亿', '2062.86亿', '2213.58亿', '2423.13亿', '2387.85亿', NULL, NULL, '2018', '欧洲');
INSERT INTO `country` VALUES (25, '斐济', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2018', '大洋洲');
INSERT INTO `country` VALUES (26, '密克罗尼西亚联邦', NULL, '3.19亿', '3.16亿', '3.32亿', '3.67亿', '4.02亿', NULL, NULL, NULL, '2018', '大洋洲');
INSERT INTO `country` VALUES (27, '马耳他', NULL, '116.26亿', '110.91亿', '116.65亿', '131.47亿', '147.51亿', '149.89亿', NULL, NULL, '2018', '欧洲');
INSERT INTO `country` VALUES (28, '萨尔瓦多', NULL, '225.93亿', '234.38亿', '241.91亿', '249.79亿', '261.17亿', '270.23亿', NULL, NULL, '2018', '北美洲');
INSERT INTO `country` VALUES (29, '多米尼加', NULL, '671.8亿', '711.65亿', '757.05亿', '799.98亿', '855.55亿', '889.41亿', NULL, NULL, '2018', '北美洲');
INSERT INTO `country` VALUES (30, '智利', NULL, '2605.42亿', '2439.19亿', '2504.4亿', '2770.45亿', '2982.58亿', '2823.18亿', NULL, NULL, '2018', '南美洲');
INSERT INTO `country` VALUES (31, '萨摩亚', NULL, '7.57亿', '7.88亿', '7.99亿', '8.32亿', '8.21亿', '8.52亿', NULL, NULL, '2018', '大洋洲');
INSERT INTO `country` VALUES (32, '苏里南', NULL, '52.41亿', '47.87亿', '31.29亿', '32.16亿', '34.65亿', '36.97亿', NULL, NULL, '2018', '南美洲');
INSERT INTO `country` VALUES (33, '格林纳达', NULL, '9.11亿', '9.97亿', '10.62亿', '11.26亿', '11.69亿', '12.11亿', NULL, NULL, '2018', '北美洲');
INSERT INTO `country` VALUES (34, '委内瑞拉', NULL, '4823.59亿', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2018', '南美洲');
INSERT INTO `country` VALUES (35, '多哥', NULL, '45.75亿', '41.81亿', '44.87亿', '48.2亿', '53.64亿', '54.9亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (36, '冈比亚', NULL, '12.29亿', '13.78亿', '14.85亿', '15.05亿', '16.71亿', '18.26亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (37, '乌干达', NULL, '324.72亿', '322.48亿', '290.79亿', '307.56亿', '329.16亿', '351.65亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (38, '佛得角', NULL, '18.6亿', '15.97亿', '16.63亿', '17.7亿', '19.67亿', '19.82亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (39, '布隆迪', NULL, '27.06亿', '31.04亿', '29.6亿', '31.72亿', '30.37亿', '30.12亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (40, '坦桑尼亚', NULL, '499.65亿', '473.79亿', '497.74亿', '533.21亿', '580.01亿', '631.77亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (41, '津巴布韦', NULL, '194.96亿', '199.63亿', '205.49亿', '220.41亿', '243.12亿', '214.41亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (42, '刚果（布）', NULL, '141.96亿', '85.57亿', '103.35亿', '111.99亿', '135.18亿', '122.67亿', NULL, NULL, '2021', '非洲');
INSERT INTO `country` VALUES (43, '乍得', NULL, '139.41亿', '109.5亿', '100.98亿', '100.0亿', '112.39亿', '113.15亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (44, '尼日利亚', NULL, '5466.76亿', '4868.03亿', '4046.5亿', '3757.46亿', '3971.9亿', '4481.2亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (45, '肯尼亚', NULL, '614.48亿', '640.08亿', '691.89亿', '789.65亿', '877.79亿', '955.03亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (46, '安哥拉', NULL, '1457.12亿', '1161.94亿', '1011.24亿', '1221.24亿', '1013.53亿', '888.16亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (47, '纳米比亚', NULL, '123.56亿', '112.72亿', '106.66亿', '127.42亿', '134.54亿', '123.67亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (48, '加蓬', NULL, '182.04亿', '143.83亿', '140.24亿', '149.29亿', '168.62亿', '168.74亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (49, '莫桑比克', NULL, '177.16亿', '159.51亿', '119.37亿', '132.19亿', '148.46亿', '152.91亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (50, '赞比亚', NULL, '271.51亿', '212.43亿', '209.55亿', '258.68亿', '263.12亿', '233.1亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (51, '加纳', NULL, '536.6亿', '485.65亿', '550.1亿', '589.98亿', '655.56亿', '669.84亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (52, '塞舌尔', NULL, '13.43亿', '13.77亿', '14.27亿', '15.24亿', '15.86亿', '17.03亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (53, '南苏丹', NULL, '139.62亿', '119.98亿', '30.71亿', NULL, NULL, NULL, NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (54, '喀麦隆', NULL, '349.89亿', '309.29亿', '326.44亿', '350.09亿', '386.94亿', '390.07亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (55, '塞拉利昂', NULL, '50.15亿', '42.19亿', '36.75亿', '37.4亿', '40.85亿', '41.22亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (56, '科特迪瓦', NULL, '353.64亿', '331.31亿', '352.97亿', '380.54亿', '430.07亿', '585.39亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (57, '阿尔及利亚', NULL, '2138.6亿', '1663.61亿', '1599.95亿', '1701.63亿', '1754.06亿', '1710.91亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (58, '哥斯达黎加', NULL, '505.78亿', '547.76亿', '571.58亿', '584.82亿', '605.54亿', '618.01亿', NULL, NULL, '2018', '北美洲');
INSERT INTO `country` VALUES (59, '吉布提', NULL, '14.55亿', '16.34亿', '17.64亿', '18.45亿', '19.66亿', '33.25亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (60, '毛里塔尼亚', NULL, '65.93亿', '48.29亿', '46.79亿', '49.06亿', '52.35亿', '76.01亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (61, '几内亚', NULL, '87.78亿', '87.94亿', '85.96亿', '103.25亿', '109.07亿', '122.97亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (62, '索马里', NULL, '65.62亿', '66.69亿', '68.4亿', '71.28亿', '74.84亿', NULL, NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (63, '希腊', '2,7', '2370.3亿', '1965.91亿', '1952.22亿', '2035.88亿', '2181.38亿', '2098.53亿', NULL, NULL, '2018', '欧洲');
INSERT INTO `country` VALUES (64, '乌拉圭', NULL, '572.36亿', '532.74亿', '526.88亿', '595.3亿', '595.97亿', '560.46亿', NULL, NULL, '2018', '南美洲');
INSERT INTO `country` VALUES (65, '纽埃', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2018', '大洋洲');
INSERT INTO `country` VALUES (66, '多米尼克', NULL, '5.2亿', '5.41亿', '5.76亿', '5.2亿', '5.51亿', '5.82亿', NULL, NULL, '2018', '北美洲');
INSERT INTO `country` VALUES (67, '圭亚那', NULL, '30.78亿', '31.97亿', '35.04亿', '35.55亿', '47.88亿', '51.74亿', NULL, NULL, '2018', '南美洲');
INSERT INTO `country` VALUES (68, '卢旺达', NULL, '82.46亿', '85.45亿', '86.97亿', '92.53亿', '96.36亿', '103.54亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (69, '塞内加尔', NULL, '197.97亿', '177.75亿', '190.4亿', '209.97亿', '232.36亿', '235.78亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (70, '突尼斯', NULL, '476.32亿', '431.73亿', '418.01亿', '398.02亿', '397.7亿', '387.97亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (71, '利比亚', NULL, '411.43亿', '278.42亿', '261.97亿', '378.83亿', '526.08亿', '520.91亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (72, '巴布亚新几内亚', NULL, '232.11亿', '217.24亿', '207.59亿', '227.43亿', '241.1亿', '248.29亿', NULL, NULL, '2018', '大洋洲');
INSERT INTO `country` VALUES (73, '玻利维亚', NULL, '329.96亿', '330.0亿', '339.41亿', '375.09亿', '402.88亿', '408.95亿', NULL, NULL, '2018', '南美洲');
INSERT INTO `country` VALUES (74, '安提瓜和巴布达', NULL, '12.5亿', '13.37亿', '14.37亿', '14.68亿', '16.05亿', '16.62亿', NULL, NULL, '2018', '北美洲');
INSERT INTO `country` VALUES (75, '特立尼达和多巴哥', NULL, '276.16亿', '250.63亿', '222.85亿', '224.75亿', '238.08亿', '242.7亿', NULL, NULL, '2018', '北美洲');
INSERT INTO `country` VALUES (76, '奥地利', NULL, '4419.96亿', '3818.18亿', '3955.69亿', '4172.38亿', '4550.95亿', '4450.75亿', NULL, NULL, '2018', '欧洲');
INSERT INTO `country` VALUES (77, '马达加斯加', NULL, '125.23亿', '113.23亿', '118.49亿', '131.76亿', '138.53亿', '141.15亿', NULL, NULL, '2017', '非洲');
INSERT INTO `country` VALUES (78, '巴拿马', NULL, '499.21亿', '540.92亿', '579.08亿', '622.19亿', '651.28亿', '668.01亿', NULL, NULL, '2017', '北美洲');
INSERT INTO `country` VALUES (79, '摩洛哥', NULL, '1100.81亿', '1011.8亿', '1033.12亿', '1096.83亿', '1180.96亿', '1197.0亿', NULL, NULL, '2017', '非洲');
INSERT INTO `country` VALUES (80, '埃塞俄比亚', NULL, '556.12亿', '645.89亿', '742.97亿', '817.71亿', '842.69亿', '959.13亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (81, '苏丹', NULL, '649.42亿', '742.95亿', '955.58亿', '1230.53亿', '331.28亿', '189.02亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (82, '新西兰', NULL, '2009.22亿', '1774.68亿', '1882.24亿', '2054.16亿', '2079.21亿', '2069.29亿', NULL, NULL, '2017', '大洋洲');
INSERT INTO `country` VALUES (83, '波黑', '1', '185.58亿', '162.12亿', '169.13亿', '180.8亿', '201.84亿', '201.64亿', NULL, NULL, '2017', '欧洲');
INSERT INTO `country` VALUES (84, '黑山', NULL, '45.88亿', '40.53亿', '43.74亿', '48.45亿', '55.04亿', '55.43亿', NULL, NULL, '2017', '欧洲');
INSERT INTO `country` VALUES (85, '土库曼斯坦', '2', '435.24亿', '358.0亿', '361.8亿', '379.26亿', '407.61亿', NULL, NULL, NULL, NULL, NULL);
INSERT INTO `country` VALUES (86, '立陶宛', '1', '485.75亿', '414.19亿', '430.18亿', '477.59亿', '537.23亿', '546.27亿', NULL, NULL, '2017', '欧洲');
INSERT INTO `country` VALUES (87, '拉脱维亚', '1', '313.29亿', '272.4亿', '280.52亿', '304.59亿', '344.16亿', '341.03亿', NULL, NULL, '2017', '欧洲');
INSERT INTO `country` VALUES (88, '巴勒斯坦', NULL, '139.9亿', '139.72亿', '154.05亿', '161.28亿', '162.77亿', NULL, NULL, NULL, NULL, NULL);
INSERT INTO `country` VALUES (89, '阿尔巴尼亚', '1', '132.28亿', '113.87亿', '118.61亿', '130.2亿', '151.47亿', '152.79亿', NULL, NULL, '2017', '欧洲');
INSERT INTO `country` VALUES (90, '阿富汗', '7', '204.85亿', '199.07亿', '180.18亿', '188.7亿', '183.54亿', '192.91亿', NULL, NULL, '2016', '亚洲');
INSERT INTO `country` VALUES (91, '爱沙尼亚', '1', '267.73亿', '230.49亿', '242.6亿', '269.52亿', '306.31亿', '314.71亿', NULL, NULL, '2017', '欧洲');
INSERT INTO `country` VALUES (92, '巴基斯坦', '3,7', '2443.61亿', '2705.56亿', '2786.55亿', '3045.67亿', '3145.68亿', '2782.22亿', NULL, NULL, '2017', '亚洲');
INSERT INTO `country` VALUES (93, '斯洛文尼亚', '1', '499.31亿', '430.9亿', '447.36亿', '485.87亿', '541.62亿', '541.74亿', NULL, NULL, '2017', '欧洲');
INSERT INTO `country` VALUES (94, '克罗地亚', '1', '576.4亿', '495.26亿', '516.01亿', '554.82亿', '613.75亿', '607.53亿', NULL, NULL, '2017', '欧洲');
INSERT INTO `country` VALUES (95, '黎巴嫩', '2', '481.34亿', '499.39亿', '512.05亿', '531.41亿', '549.61亿', '519.92亿', NULL, NULL, '2017', '亚洲');
INSERT INTO `country` VALUES (96, '阿曼', '2', '806.87亿', '684.0亿', '654.81亿', '705.98亿', '797.89亿', '763.32亿', NULL, NULL, '2018', '亚洲');
INSERT INTO `country` VALUES (97, '巴林', '2', '333.88亿', '310.51亿', '322.35亿', '354.74亿', '376.52亿', '385.74亿', NULL, NULL, '2018', '亚洲');
INSERT INTO `country` VALUES (98, '也门', '2', '432.06亿', '424.51亿', '309.36亿', '267.36亿', '234.86亿', '225.81亿', NULL, NULL, '2019', '亚洲');
INSERT INTO `country` VALUES (99, '埃及', '2,7', '3055.95亿', '3293.67亿', '3324.42亿', '2357.34亿', '2497.13亿', '3030.92亿', NULL, NULL, '2016', '非洲');
INSERT INTO `country` VALUES (100, '约旦', '2', '368.48亿', '385.87亿', '398.93亿', '414.09亿', '429.32亿', '445.03亿', NULL, NULL, NULL, NULL);
INSERT INTO `country` VALUES (101, '叙利亚', '2', '274.4亿', '241.72亿', '173.97亿', '187.71亿', '228.64亿', '293.71亿', NULL, NULL, NULL, NULL);
INSERT INTO `country` VALUES (102, '印度尼西亚', '7', '8904.8亿', '8606亿', '9317亿', '10156亿', '10421亿', '11192亿', NULL, NULL, '2018', '亚洲');
INSERT INTO `country` VALUES (103, '菲律宾', '7', '2974.84亿', '3064.46亿', '3186.27亿', '3284.81亿', '3468.42亿', '3767.96亿', NULL, NULL, '2018', '亚洲');
INSERT INTO `country` VALUES (104, '缅甸', '5,6,7', '654.46亿', '678.23亿', '671.84亿', '689.46亿', '761.68亿', '760.86亿', NULL, NULL, '2017', '亚洲');
INSERT INTO `country` VALUES (105, '文莱', '7', '170.98亿', '129.3亿', '114.01亿', '121.28亿', '135.67亿', '134.69亿', NULL, NULL, '2017', '亚洲');
INSERT INTO `country` VALUES (106, '东帝汶', NULL, '40.42亿', '30.93亿', '25.04亿', '24.87亿', '25.81亿', '20.18亿', NULL, NULL, '2017', '亚洲');
INSERT INTO `country` VALUES (107, '不丹', NULL, '19.07亿', '20.04亿', '21.59亿', '24.5亿', '24.47亿', '25.31亿', NULL, NULL, NULL, NULL);
INSERT INTO `country` VALUES (108, '阿联酋', '2', '4031.37亿', '3581.35亿', '3570.45亿', '3856.06亿', '4222.15亿', '4211.42亿', NULL, NULL, '2018', '亚洲');
INSERT INTO `country` VALUES (109, '泰国', '5,7', '4073.39亿', '4012.96亿', '4134.3亿', '4562.95亿', '5065.14亿', '5435.49亿', NULL, NULL, '2017', '亚洲');
INSERT INTO `country` VALUES (110, '越南', '5,7', '1862.05亿', '1932.41亿', '2052.76亿', '2237.8亿', '2452.14亿', '2619.21亿', NULL, NULL, '2017', '亚洲');
INSERT INTO `country` VALUES (111, '新加坡', '5,7', '3148.51亿', '3080.04亿', '3186.52亿', '3418.63亿', '3732.17亿', '3720.63亿', NULL, NULL, '2017', '亚洲');
INSERT INTO `country` VALUES (112, '以色列', '2', '3095.58亿', '2998.13亿', '3189.51亿', '3532.53亿', '3705.88亿', '3946.52亿', NULL, NULL, NULL, NULL);
INSERT INTO `country` VALUES (113, '阿塞拜疆', '1', '752.44亿', '530.74亿', '378.68亿', '408.66亿', '471.13亿', '480.48亿', NULL, NULL, '2015', '亚洲');
INSERT INTO `country` VALUES (114, '亚美尼亚', '1', '116.1亿', '105.53亿', '105.46亿', '115.27亿', '124.58亿', '136.73亿', NULL, NULL, '2015', '亚洲');
INSERT INTO `country` VALUES (115, '捷克', '1', '2093.59亿', '1880.33亿', '1962.72亿', '2186.29亿', '2489.09亿', '2506.81亿', NULL, NULL, '2015', '欧洲');
INSERT INTO `country` VALUES (116, '孟加拉国', '6,7', '1728.85亿', '1950.79亿', ' 	2214.15亿', '2497.11亿', ' 	2740.39亿', '3025.71亿', NULL, NULL, '2016', '亚洲');
INSERT INTO `country` VALUES (117, '白俄罗斯', '1', '788.14亿', '564.55亿', '477.23亿', '547.27亿', '600.31亿', '630.8亿', NULL, NULL, '2015', '欧洲');
INSERT INTO `country` VALUES (118, '柬埔寨', '5,7', '167.03亿', '180.5亿', '200.17亿', '221.77亿', '245.72亿', '270.89亿', NULL, NULL, '2016', '亚洲');
INSERT INTO `country` VALUES (119, '格鲁吉亚', '1', '176.27亿', '149.54亿', '151.42亿', '162.43亿', '176.0亿', '174.77亿', NULL, NULL, '2015', '亚洲');
INSERT INTO `country` VALUES (120, '匈牙利', '1', '1407.65亿', '1250.74亿', '1284.71亿', '1429.62亿', '1604.19亿', '1634.69亿', NULL, NULL, '2015', '欧洲');
INSERT INTO `country` VALUES (121, '伊拉克', '2', '2346.48亿', '1774.99亿', '1748.96亿', '1954.73亿', '2242.28亿', '2340.94亿', NULL, NULL, '2015', '亚洲');
INSERT INTO `country` VALUES (122, '伊朗', '2', '4326.87亿', '3849.51亿', '4179.84亿', '4453.45亿', '4539.96亿', NULL, NULL, NULL, '2016', '亚洲');
INSERT INTO `country` VALUES (123, '吉尔吉斯斯坦', '2', '74.68亿', '66.78亿', '68.13亿', '77.03亿', '82.71亿', '84.55亿', NULL, NULL, '2018', '亚洲');
INSERT INTO `country` VALUES (124, '老挝', '5,7', '132.68亿', '143.9亿', '158.06亿', '168.53亿', '179.54亿', '181.74亿', NULL, NULL, '2016', '亚洲');
INSERT INTO `country` VALUES (125, '哈萨克斯坦', '1,2', '2214.16亿', '1843.88亿', '1372.78亿', '1668.06亿', '1793.4亿', '1816.66亿', NULL, NULL, '2014', '亚洲');
INSERT INTO `country` VALUES (126, '卡塔尔', '2', '2062.25亿', '1617.4亿', '1517.32亿', '1610.99亿', '1833.35亿', '1758.38亿', NULL, NULL, '2014', '亚洲');
INSERT INTO `country` VALUES (127, '科威特', '2', '1626.31亿', '1145.67亿', '1094.2亿', '1207.07亿', '1406.45亿', '1346.29亿', NULL, NULL, '2014', '亚洲');
INSERT INTO `country` VALUES (128, '摩尔多瓦', '1', '95.1亿', '77.45亿', '80.71亿', '96.7亿', '114.57亿', '119.69亿', NULL, NULL, '2017', '欧洲');
INSERT INTO `country` VALUES (129, '马尔代夫', '7', '36.97亿', '41.09亿', '43.79亿', '47.54亿', '53.0亿', '56.42亿', NULL, NULL, '2017', '亚洲');
INSERT INTO `country` VALUES (130, '马来西亚', '5,7', '3380.62亿', '3013.55亿', '3012.55亿', '3191.12亿', '3587.15亿', '3646.81亿', NULL, NULL, '2017', '亚洲');
INSERT INTO `country` VALUES (131, '北马其顿', '1', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2015', '欧洲');
INSERT INTO `country` VALUES (132, '蒙古国', '4', '122.27亿', '117.5亿', '111.87亿', '114.26亿', '130.67亿', '140.7亿', NULL, NULL, '2017', '亚洲');
INSERT INTO `country` VALUES (133, '尼泊尔', '7', '200.03亿', '214.11亿', '211.86亿', '251.81亿', '291.74亿', '306.41亿', NULL, NULL, '2017', '亚洲');
INSERT INTO `country` VALUES (134, '波兰', '1', '5424.77亿', '4778.12亿', '4726.3亿', '5265.09亿', '5874.12亿', '5958.58亿', NULL, NULL, '2015', '欧洲');
INSERT INTO `country` VALUES (135, '保加利亚', '1', '569.02亿', '506.47亿', '538.07亿', '589.72亿', '662.3亿', '685.59亿', NULL, NULL, '2015', '欧洲');
INSERT INTO `country` VALUES (136, '罗马尼亚', '1', '1999.59亿', '1777.29亿', '1881.29亿', '2116.95亿', '2414.57亿', '2500.77亿', NULL, NULL, '2017', '欧洲');
INSERT INTO `country` VALUES (137, '塞尔维亚', '1', '470.62亿', '396.56亿', '406.93亿', '441.79亿', '506.41亿', '514.75亿', NULL, NULL, '2015', '欧洲');
INSERT INTO `country` VALUES (138, '沙特阿拉伯', '2', '7563.5亿', '6542.7亿', '6449.36亿', '6885.86亿', '7865.22亿', '7929.67亿', NULL, NULL, '2017', '亚洲');
INSERT INTO `country` VALUES (139, '斯洛伐克', '1', '1011.9亿', '884.68亿', '896.55亿', '954.94亿', '1057.02亿', '1050.8亿', NULL, NULL, '2015', '欧洲');
INSERT INTO `country` VALUES (140, '塔吉克斯坦', '2', '91.13亿', '78.55亿', '69.53亿', '71.58亿', '75.23亿', '81.17亿', NULL, NULL, '2015', '亚洲');
INSERT INTO `country` VALUES (141, '俄罗斯', '1,4', '20600.0亿', '13600.0亿', '12800.0亿', '15700.0亿', '16700.0亿', '17000.0亿', NULL, NULL, '2015', '欧洲');
INSERT INTO `country` VALUES (142, '南非', NULL, '3509.05亿', '3176.21亿', '2963.57亿', '3495.54亿', '3682.89亿', '3514.32亿', NULL, NULL, '2018', '非洲');
INSERT INTO `country` VALUES (143, '斯里兰卡', '7', '793.56亿', '806.04亿', '824.01亿', '874.28亿', '884.26亿', '840.09亿', NULL, NULL, '2014', '亚洲');
INSERT INTO `country` VALUES (144, '韩国', NULL, '14800.0亿', '14700.0亿', '15000.0亿', '16200.0亿', '17200.0亿', '16500.0亿', NULL, NULL, '2015', '亚洲');
INSERT INTO `country` VALUES (145, '土耳其', '2', '9389.34亿', '8643.14亿', '8696.83亿', '8589.89亿', '7783.82亿', '7614.25亿', NULL, NULL, '2015', '亚洲');
INSERT INTO `country` VALUES (146, '乌克兰', '1', '1335.03亿', '910.31亿', '933.56亿', '1121.9亿', '1309.02亿', '1537.81亿', NULL, NULL, '2017', '欧洲');
INSERT INTO `country` VALUES (147, '乌兹别克斯坦', '2', '766.59亿', '818.47亿', '817.79亿', '591.6亿', '503.93亿', '579.21亿', NULL, NULL, '2015', '亚洲');
INSERT INTO `country` VALUES (148, '印度', NULL, '20405亿', '21045亿', '22949亿', '26523亿', '27130亿', '29130亿', NULL, NULL, NULL, NULL);

-- ----------------------------
-- Table structure for trade_cooperation
-- ----------------------------
DROP TABLE IF EXISTS `trade_cooperation`;
CREATE TABLE `trade_cooperation`  (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `type` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `time` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `data` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  PRIMARY KEY (`Id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 19 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of trade_cooperation
-- ----------------------------
INSERT INTO `trade_cooperation` VALUES (1, 'investment_volume', '2015', '148.2亿美元');
INSERT INTO `trade_cooperation` VALUES (2, 'investment_volume', '2016', '145.3亿美元');
INSERT INTO `trade_cooperation` VALUES (3, 'investment_volume', '2017', '143.6亿美元');
INSERT INTO `trade_cooperation` VALUES (4, 'investment_volume', '2018', '156.4亿美元');
INSERT INTO `trade_cooperation` VALUES (5, 'investment_volume', '2019', '150.4亿美元');
INSERT INTO `trade_cooperation` VALUES (6, 'investment_volume', '2020', '177.9亿美元');
INSERT INTO `trade_cooperation` VALUES (7, 'new_contract', '2015', '3987份');
INSERT INTO `trade_cooperation` VALUES (8, 'new_contract', '2016', '8158份');
INSERT INTO `trade_cooperation` VALUES (9, 'new_contract', '2017', '7217份');
INSERT INTO `trade_cooperation` VALUES (10, 'new_contract', '2018', '7721份');
INSERT INTO `trade_cooperation` VALUES (11, 'new_contract', '2019', '6944份');
INSERT INTO `trade_cooperation` VALUES (12, 'new_contract', '2020', '5611份');
INSERT INTO `trade_cooperation` VALUES (13, 'turnover', '2015', '692.6亿美元');
INSERT INTO `trade_cooperation` VALUES (14, 'turnover', '2016', '759.7亿美元');
INSERT INTO `trade_cooperation` VALUES (15, 'turnover', '2017', '855.3亿美元');
INSERT INTO `trade_cooperation` VALUES (16, 'turnover', '2018', '893.3亿美元');
INSERT INTO `trade_cooperation` VALUES (17, 'turnover', '2019', '979.8亿美元');
INSERT INTO `trade_cooperation` VALUES (18, 'turnover', '2020', '911.2亿美元');

SET FOREIGN_KEY_CHECKS = 1;
